Revit 2024 API
NamingUtils Class
 A collection of utilities related to element naming.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class NamingUtils
Visual Basic
Public NotInheritable Class NamingUtils
Visual C++
public ref class NamingUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NamingUtils
See Also
NamingUtils Members
Autodesk.Revit.DB Namespace